update 4 layer agent architecrure and agent architecture overview
